nilava/immurok-esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom partition table (roomy NVS + 3MB app)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BLE only (S3 has no BT Classic); Bluedroid with GATTS + SMP for Just Works bonding
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_GATTS_ENABLE=y

# Logs over the built-in USB-Serial-JTAG (no TinyUSB in this project)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# mbedTLS: ECDH P-256 + HMAC are default-on; keep the cert bundle off (not needed)
